v2206/solver_ADMFoam/multi_bubbleComparison/iso/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [0 2 -2 0 0 0 0];
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101300;

boundaryField
{
    movingWall
    {
        // type            fixedFluxPressure;
        // rho             rhok;
        // value           $internalField;
        
        type            totalPressure;
        p0              $internalField;

        // U               U;
        // phi             phi;
        // rho             rho;
        // psi             none;
        // gamma           1;
        // value           uniform 0;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        value           $internalField;
        // rho             rhok;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
