v2206/solver_ADMFoam/multi_bubbleComparison/iso/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Viscosity
nu              1e-5;

// Thermal expansion coefficient
beta            3e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              0.7;

// Turbulent Prandtl number
Prt             0.85;


// multiphase testing

phases (liquid gas);

liquid
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

gas
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}


sigma               0.07;


// phases
// (
//     liquid
//     {
//         transportModel Newtonian;
//         nu             1e-06;
//         rho            1000;
//     }

//     gas
//     {
//         transportModel  Newtonian;
//         nu              1.8e-8; 
//         rho             1.3; 
//         isRhoField      false;

//         // nu              1e-06;
//         // rho             0.657;
//     }
// );

// sigmas
// (
//     (liquid gas) 0.07
// );



// ************************************************************************* //
