v2206/solver_ADMFoam/multi_bubbleComparison/iso/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    // default             none;
    // div(phi,Yi)         bounded Gauss limitedLinear 1;
    // div(phi,Gi)         bounded Gauss limitedLinear 1;
    default             bounded Gauss limitedLinear 1; 

    // div(phi,k)          Gausee upwind; // Gauss limitedLinear 1;
    // div(phi,omega)      Gausee upwind; // Gauss upwind;
    // div(phi,epsilon)    Gausee upwind; // Gauss linear;

    // testing
    div(rhoPhi,T)       Gauss upwind;
    div(rhoPhi,U)       Gauss limitedLinearV 1;
    // div(rhoPhi,U)       Gauss upwind;
    // div(phi,alpha)      Gauss vanLeer;
    // div(phirb,alpha)    Gauss linear;

    div((muEff*dev(T(grad(U)))))  Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default          no;
    p_rgh;
    pcorr;
    alpha.liquid;
}

// ************************************************************************* //
